name: "gnn"
platform: "pytorch_libtorch"
max_batch_size : 0
input [
  {
    name: "INPUT__0"
    data_type: TYPE_FP32
    dims: [ -1, 3 ]
  },
  {
    name: "INPUT__1"
    data_type: TYPE_INT64
    dims: [ 2, -1 ]
  }
]

output [
  {
    name: "OUTPUT__0"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]

instance_group [
  { 
    count: 1
    kind: KIND_GPU 
    gpus: [ 0 ]
  }
]
