name: "applyfilter"
backend: "python"

input [
  {
    name: "FILTER_SCORES"
    data_type: TYPE_FP32
    dims: [ -1, 1 ]
  }
]

input [
    {
        name: "EDGE_LIST"
        data_type: TYPE_INT64
        dims: [ 2, -1 ]
    }
]

output [
  {
    name: "EDGE_LIST_AFTER_FILTER"
    data_type: TYPE_INT64
    dims: [ 2, -1 ]
  }
]


instance_group [{ kind: KIND_GPU }]
parameters: {
  key: "EXECUTION_ENV_PATH",
  value: {string_value: "/pymodels/frnn.tar.gz"}
}