name: "gnno"
platform: "onnxruntime_onnx"
max_batch_size : 0
input [
  {
    name: "INPUT__0"
    data_type: TYPE_FP32
    dims: [ -1, 12 ]
  },
  {
    name: "INPUT__1"
    data_type: TYPE_INT64
    dims: [ 2, -1 ]
  }
]

output [
  {
    name: "OUTPUT__0"
    data_type: TYPE_FP32
    dims: [ -1, 1 ]
  }
]

instance_group [{ kind: KIND_GPU }]
